# Options Constructor (Options) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Options Constructor (Options)
Options Class See Also
---
Copy constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Options(
	Options pOptions
)
```

Visual Basic
---
```text
Public Sub New ( _
	pOptions As Options _
)
```

Visual C++
---
```text
public:
Options(
	Options^ pOptions
)
```

# ### Parameters
pOptions
    Type: Autodesk.Revit.DB..::..Options
# See Also
Options Class
Options Overload
Autodesk.Revit.DB Namespace